
const div = document.querySelector("#main-div")
const odiv = document.querySelector("#other-div")

const add = () => {
  setInterval(() => {
    // div.style.textShadow = `${Math.floor(Math.random() * 500) - 10}px ${Math.floor(Math.random() * 500) - 10}px ${Math.floor(Math.random() * 3)}px rgba(255, 255, 255, .3${Math.floor(Math.random() * 10)})`
    div.style.paddingTop = `${Math.floor(Math.random() * 100)}px`
    div.style.paddingLeft = `${Math.floor(Math.random() * 50)}%`
    div.style.opacity = `.${Math.floor(Math.random() * 5)}`
    div.style.textShadow = `${Math.floor(Math.random() * 500) - 10}px ${Math.floor(Math.random() * 500) - 10}px 0 rgba(255, 255, 255, .2${Math.floor(Math.random() * 10)}), 
    ${Math.floor(Math.random() * 500) - 10}px ${Math.floor(Math.random() * 500) - 10}px 0 rgba(255, 255, 255, .2${Math.floor(Math.random() * 5)}), 
    ${Math.floor(Math.random() * 500) - 10}px ${Math.floor(Math.random() * 500) - 10}px 0 rgba(255, 255, 255, .2${Math.floor(Math.random() * 5)}), 
    ${Math.floor(Math.random() * 500) - 10}px ${Math.floor(Math.random() * 500) - 10}px 0 rgba(255, 255, 255, .2${Math.floor(Math.random() * 5)})`
    div.innerHTML += "c̸̡̡̧̡̢̡̧̡̢̨̧̧̡̼͎̖̬͕̠̹̝̲̦͚̭̪̗̥̟͇͍͈̟̹̬͍͓̲͙̻̹͔̙̳̥̞̲̥̜̖̬̘͕̰̺̞̖͓͙̳̹̗̻͕̰̻̱̳̙͕͎͓̼̥͚͇̦̗̫̬̺̙̙͉̼̗͇͇̪̙͇͔̲̬͎̰̘̘̟̱̙̦̗̱̗̦͈̖͍͔̳̩̖̟͖̺̼̤͇̤̯͍̝̤̟͇͖̝̘̖͖̤̝̠͙͔̠̱͕̺̹̦͛́̔̀̀͋̉͜͜͜͜͝ͅͅa̶̢̢̢̡̨̡̨̢̡̡̡̨̧̨̨̡̡̢̧̡̡̧̧̛̛̛̛̛͚̳̪͈͚̪̪̫̪͉̲̩͍̬̩̤̥̬̩̥̝̭̙͉̦͚̹͚̪̹̣͚̭̰̠͕͍̣̱̮̖̞͍̠͍̪̯̹̫̻̫̝̦̰̱̣̲̦̼̭̜͙̥͔̹͖̩͖̩̪̻̞̫̖͍̭͈̝̘̱̳͙͉͎̼̟̦̭̥̪̘̻̩̱̰̥̟͔̖̫̦̘̬̼̹̱̪̼͇̫̱̩̣̜̦̱̻͉̱̰͙̥̤̯̘̼͇͕̞̫̮̤͈̥̳̟͇̞̥̰͇̮͓͔̗̻̩̱̯̲̼̜̟̣̱͚͉̦͍͉̝̯̬͍̼̳͈͖̰͈͇͉̟̱̭̮̞̼̼̠̝̯͓̱̬̰̝̘̜͇̲̞͖̭̼̞̰͙̦̞͎̺̲̗̰̖̱̞̠̪̝͕̞͎̼̘̯̥̝͓͕̰̜̤̙͚̮̯͚͚̟̝̰̲̰̪̦̩̤͔̟̗̙̣̓̄͛̉̓̈́̊͒̆́̃͋̅̀̅͑̃͋́͂̈̐̄̍̀̋̈̍͛̏̈́́̐͛͊̑̔͂̎̐́̂̂́̒͊͊͌̾̍̇̓̀̔̏̏̌̇͒̅̈̌̽͋̄̏͌͛̂̉͒̉̈͊͛͂͒̋̀̐̈̔̎͗̑̆͌͊̊͒̓͌͊̒̐̉̈̊͒͗̃̃́̆̅̽̆͊̕̕̕̕̕͘͘͜͜͜͜͜͜͝͝͝͝͝͝͠͠͝͝͠͝ͅͅͅv̴̧̛̛̛̛̛̛̛͙͖̰̩͉͕̖̪̺͇͍̹̟̭́͌́͑̏̇̓͂̉̌̐̈́̀͆͆͛͒̓̆̊͆̄̍̀͛̽̑̄̈́̍͗̽͛͌͗͊͗̉͛̔͌͗̾́̂́̏̎̽̔̽͑͌̇̌̅̈̋͛̾̅͒̈͊̀͛̆̔͊̇͐͛́̉̕͘̕͘̕̕̕̚̕͝͝͝͝͝͠ȩ̵̛̛̗̼̠̖̭͈̲̤͇̻̯̯͈̦̓̀̓̾̐͂̓̎͌͊͆͌̿̑̆̎̄̉̊̉͑̂͆̾̈̎̍̿̎͒̉̓́͛̆͐͗̿̓́̐͒͒͒̎̉̾̏̑̉͗̃͋͊͂̂̌̾̆̈̊̀̒̆́̋̿̎͑̇̀͗̔͊̃̈͌́̀͋̂̐̑̀̒̈͋̾̆̎̓̾̅́̑͂͂̍͐̚͘̚̕̚͘͘͜͠͠͠͠͝͝͠͠͝w̵̙͙̗̱̳͙̪̲̫̩͔̹̔̄̾̏̌̈́̔̎̈̉̉́́̎̊͒͊̿̒̒̾͌̈͐͛̑̉͊͛̒̊̃̐͌͌̓̔̐̈́̅̍̔̌̄̉́̀̋̂̎̄̽́͛̽͐̆̄̄̕͠͝͝͠͝͝͝͝î̴̡̨̧̡̧̧̡̨̢̡̡̡̧̧̧̧̨̢̨̨̡̡̨̛̛̛̪̼͉͕̼̻̫̜͓͚͍̖̯͖̭̮͓̘̫̤͎̦͕̝̖̻̙͙͓̻͇̺͎̖̬̝̳͍͎͖̜͚͙͙̜͈̹̩̗̞̮̼͍̹̻͉̞̦̳̦͎̱͇̯̫͕͖͍̣͔͚̝̭̙͈̮͔̖̜̦̣͚̱͕͚͍̹̻̜̮̲͎͙̥̫̭͓͇̥̬̭̼̗̟͕͉̭̯̜͔̮̩͈͙̤͕͍̹̩̱̤͙̙̪͇̗̹͙̜̫̼̩͚̲̠̹̝̰͚̳̝̗̙̗̦̠͖̼͍̲̞̠͉͖̜̱͍̳̣̥͍̞̟̼̟͚͓̘̥̤͍̰̺̙̭̼̖͎̬͕̮̥̥̜͓̭̜̹̩͙̺̖̭͓̠̪̭̲̲̖̳͙̩̝͎̣̠̗͚̙̜̗̜͍͓͉͊̎̏̾̎͂͂̌̋͆̔͐̌̊͗̐̈́̿͊́̐͋͋̑̔͑̐̄̈́͗̂̓͆͋͌͑̌͆̈́͐͂̉̓͐̊͒́̾̿́̾̍̍̆̄̓̽̄͌̉͒̽́̏̅̒͐̅̐̂̔͗̿̿͊̊̍͆͋͋͑̉̐͐̅͗͛̊̉͊̀͆̃̇̆̑̒̍̑̏̆̏̈̏͗̍̎̒̽͂̾̀̇͊̍̈̚͘͘͘̕͘̚̕͘͜͜͜͜͝͠͝͝͝͠͠͝͝͠͝͝͝ͅͅͅͅm̸̨̡̨̨̨̡̧̢̛̛̛̛̛̛̛̛͈̯̱̬̠͎̗̮̜̘͚̙̫͈̼̖͉̤̘̳̫̩̻͓̙͚͍̥͈͎̱̘̖̙̥͚̫͇͙̩͓̰̼̟̤̺͔͙̘̱͕͈̳͖͚̻̞̳͈̩͙̙̗͈̣̗̞̘̥͖̯͈̳̱̰̩̐̄̄͋̔͂̏̆̓̏̔̽̾͌̈́̀̃̑̆̈́́̎̀͊̉͌̆̿̀̌̐̊́́̈́̽͂̇͋̃̀̃̆͒̽̑͐̈̾̔͋̉͂̾̏̆̂͂͒̑̆̾́̑̔̇̔͐͐̓̆́̓̃̇̎͂̐͊̉̄̇͒̌͆̏́̋̿͊̉̎̏̾͊̀́͐̍̅͛̃̂̾̐͋̅̽̏̄̀͋͗̄̿̇̒̂̎̀͂̌̔̿̏͆͌͂̎̊͑͊̉͛̉̇͌͋̈̔̌̈́̄̋́̀͌͐̿͋̉̉͑̍̍͐̋̔̎̐̎̌͊̂̃̌̏̆̅̂̂̑̏̈͗̏́̆̆͛̀̎͆̉̋͐̎̇͂͂̌̋̒̽͂̍̎̔͌̐̌̾͒̈̒̆̔̈̽̚̚̚͘̕̕̚̚̚͘̚͘͘͘̚̚̕̚͘̕̕̚̚̕͜͜͝͠͝͝͝͝͝͠͠͝͝͝͝͝͝ͅp̵̡̡̡̨̛̛̛̦͇̻̰̼͍̠̟͓̜̬̦̦͖͍͚̹̩̮͍̖͚̱̥̘̣͉̳̤̠̮͉̣͇̪̼̮̳̰̘͕̜̰͙̺̹͓̣͓̤̥̜̪͚̪̹̘͉̼̥̜̯̭̭̪̱͕̺̖͍̘͚̩̼͎̦̙̙̝̀̅͗̄̈́̑̿́̂̏̀̊̔̄͛̊̒̆̂̾̂̃̃̓͐̔͛̊͐̅̓̔̿͌̌̐͘̕͜͜͝͝ͅ bdfssasdfsaf".split("")[Math.floor(Math.random() * "c̸̡̡̧̡̢̡̧̡̢̨̧̧̡̼͎̖̬͕̠̹̝̲̦͚̭̪̗̥̟͇͍͈̟̹̬͍͓̲͙̻̹͔̙̳̥̞̲̥̜̖̬̘͕̰̺̞̖͓͙̳̹̗̻͕̰̻̱̳̙͕͎͓̼̥͚͇̦̗̫̬̺̙̙͉̼̗͇͇̪̙͇͔̲̬͎̰̘̘̟̱̙̦̗̱̗̦͈̖͍͔̳̩̖̟͖̺̼̤͇̤̯͍̝̤̟͇͖̝̘̖͖̤̝̠͙͔̠̱͕̺̹̦͛́̔̀̀͋̉͜͜͜͜͝ͅͅa̶̢̢̢̡̨̡̨̢̡̡̡̨̧̨̨̡̡̢̧̡̡̧̧̛̛̛̛̛͚̳̪͈͚̪̪̫̪͉̲̩͍̬̩̤̥̬̩̥̝̭̙͉̦͚̹͚̪̹̣͚̭̰̠͕͍̣̱̮̖̞͍̠͍̪̯̹̫̻̫̝̦̰̱̣̲̦̼̭̜͙̥͔̹͖̩͖̩̪̻̞̫̖͍̭͈̝̘̱̳͙͉͎̼̟̦̭̥̪̘̻̩̱̰̥̟͔̖̫̦̘̬̼̹̱̪̼͇̫̱̩̣̜̦̱̻͉̱̰͙̥̤̯̘̼͇͕̞̫̮̤͈̥̳̟͇̞̥̰͇̮͓͔̗̻̩̱̯̲̼̜̟̣̱͚͉̦͍͉̝̯̬͍̼̳͈͖̰͈͇͉̟̱̭̮̞̼̼̠̝̯͓̱̬̰̝̘̜͇̲̞͖̭̼̞̰͙̦̞͎̺̲̗̰̖̱̞̠̪̝͕̞͎̼̘̯̥̝͓͕̰̜̤̙͚̮̯͚͚̟̝̰̲̰̪̦̩̤͔̟̗̙̣̓̄͛̉̓̈́̊͒̆́̃͋̅̀̅͑̃͋́͂̈̐̄̍̀̋̈̍͛̏̈́́̐͛͊̑̔͂̎̐́̂̂́̒͊͊͌̾̍̇̓̀̔̏̏̌̇͒̅̈̌̽͋̄̏͌͛̂̉͒̉̈͊͛͂͒̋̀̐̈̔̎͗̑̆͌͊̊͒̓͌͊̒̐̉̈̊͒͗̃̃́̆̅̽̆͊̕̕̕̕̕͘͘͜͜͜͜͜͜͝͝͝͝͝͝͠͠͝͝͠͝ͅͅͅv̴̧̛̛̛̛̛̛̛͙͖̰̩͉͕̖̪̺͇͍̹̟̭́͌́͑̏̇̓͂̉̌̐̈́̀͆͆͛͒̓̆̊͆̄̍̀͛̽̑̄̈́̍͗̽͛͌͗͊͗̉͛̔͌͗̾́̂́̏̎̽̔̽͑͌̇̌̅̈̋͛̾̅͒̈͊̀͛̆̔͊̇͐͛́̉̕͘̕͘̕̕̕̚̕͝͝͝͝͝͠ȩ̵̛̛̗̼̠̖̭͈̲̤͇̻̯̯͈̦̓̀̓̾̐͂̓̎͌͊͆͌̿̑̆̎̄̉̊̉͑̂͆̾̈̎̍̿̎͒̉̓́͛̆͐͗̿̓́̐͒͒͒̎̉̾̏̑̉͗̃͋͊͂̂̌̾̆̈̊̀̒̆́̋̿̎͑̇̀͗̔͊̃̈͌́̀͋̂̐̑̀̒̈͋̾̆̎̓̾̅́̑͂͂̍͐̚͘̚̕̚͘͘͜͠͠͠͠͝͝͠͠͝w̵̙͙̗̱̳͙̪̲̫̩͔̹̔̄̾̏̌̈́̔̎̈̉̉́́̎̊͒͊̿̒̒̾͌̈͐͛̑̉͊͛̒̊̃̐͌͌̓̔̐̈́̅̍̔̌̄̉́̀̋̂̎̄̽́͛̽͐̆̄̄̕͠͝͝͠͝͝͝͝î̴̡̨̧̡̧̧̡̨̢̡̡̡̧̧̧̧̨̢̨̨̡̡̨̛̛̛̪̼͉͕̼̻̫̜͓͚͍̖̯͖̭̮͓̘̫̤͎̦͕̝̖̻̙͙͓̻͇̺͎̖̬̝̳͍͎͖̜͚͙͙̜͈̹̩̗̞̮̼͍̹̻͉̞̦̳̦͎̱͇̯̫͕͖͍̣͔͚̝̭̙͈̮͔̖̜̦̣͚̱͕͚͍̹̻̜̮̲͎͙̥̫̭͓͇̥̬̭̼̗̟͕͉̭̯̜͔̮̩͈͙̤͕͍̹̩̱̤͙̙̪͇̗̹͙̜̫̼̩͚̲̠̹̝̰͚̳̝̗̙̗̦̠͖̼͍̲̞̠͉͖̜̱͍̳̣̥͍̞̟̼̟͚͓̘̥̤͍̰̺̙̭̼̖͎̬͕̮̥̥̜͓̭̜̹̩͙̺̖̭͓̠̪̭̲̲̖̳͙̩̝͎̣̠̗͚̙̜̗̜͍͓͉͊̎̏̾̎͂͂̌̋͆̔͐̌̊͗̐̈́̿͊́̐͋͋̑̔͑̐̄̈́͗̂̓͆͋͌͑̌͆̈́͐͂̉̓͐̊͒́̾̿́̾̍̍̆̄̓̽̄͌̉͒̽́̏̅̒͐̅̐̂̔͗̿̿͊̊̍͆͋͋͑̉̐͐̅͗͛̊̉͊̀͆̃̇̆̑̒̍̑̏̆̏̈̏͗̍̎̒̽͂̾̀̇͊̍̈̚͘͘͘̕͘̚̕͘͜͜͜͜͝͠͝͝͝͠͠͝͝͠͝͝͝ͅͅͅͅm̸̨̡̨̨̨̡̧̢̛̛̛̛̛̛̛̛͈̯̱̬̠͎̗̮̜̘͚̙̫͈̼̖͉̤̘̳̫̩̻͓̙͚͍̥͈͎̱̘̖̙̥͚̫͇͙̩͓̰̼̟̤̺͔͙̘̱͕͈̳͖͚̻̞̳͈̩͙̙̗͈̣̗̞̘̥͖̯͈̳̱̰̩̐̄̄͋̔͂̏̆̓̏̔̽̾͌̈́̀̃̑̆̈́́̎̀͊̉͌̆̿̀̌̐̊́́̈́̽͂̇͋̃̀̃̆͒̽̑͐̈̾̔͋̉͂̾̏̆̂͂͒̑̆̾́̑̔̇̔͐͐̓̆́̓̃̇̎͂̐͊̉̄̇͒̌͆̏́̋̿͊̉̎̏̾͊̀́͐̍̅͛̃̂̾̐͋̅̽̏̄̀͋͗̄̿̇̒̂̎̀͂̌̔̿̏͆͌͂̎̊͑͊̉͛̉̇͌͋̈̔̌̈́̄̋́̀͌͐̿͋̉̉͑̍̍͐̋̔̎̐̎̌͊̂̃̌̏̆̅̂̂̑̏̈͗̏́̆̆͛̀̎͆̉̋͐̎̇͂͂̌̋̒̽͂̍̎̔͌̐̌̾͒̈̒̆̔̈̽̚̚̚͘̕̕̚̚̚͘̚͘͘͘̚̚̕̚͘̕̕̚̚̕͜͜͝͠͝͝͝͝͝͠͠͝͝͝͝͝͝ͅp̵̡̡̡̨̛̛̛̦͇̻̰̼͍̠̟͓̜̬̦̦͖͍͚̹̩̮͍̖͚̱̥̘̣͉̳̤̠̮͉̣͇̪̼̮̳̰̘͕̜̰͙̺̹͓̣͓̤̥̜̪͚̪̹̘͉̼̥̜̯̭̭̪̱͕̺̖͍̘͚̩̼͎̦̙̙̝̀̅͗̄̈́̑̿́̂̏̀̊̔̄͛̊̒̆̂̾̂̃̃̓͐̔͛̊͐̅̓̔̿͌̌̐͘̕͜͜͝͝ͅ bdfssasdfsaf".split("").length)]
    console.log(`
 /$$      /$$                              
| $$$    /$$$                              
| $$$$  /$$$$  /$$$$$$   /$$$$$$   /$$$$$$ 
| $$ $$/$$ $$ /$$__  $$ /$$__  $$ /$$__  $$
| $$  $$$| $$| $$  \ $$| $$  \__/| $$$$$$$$
| $$\  $ | $$| $$  | $$| $$      | $$_____/
| $$ \/  | $$|  $$$$$$/| $$      |  $$$$$$$
|__/     |__/ \______/ |__/       \_______/
` + "==========================================================".slice(Math.floor(Math.random() * 25)))
    odiv.innerHTML = (`
 /$$      /$$                              
| $$$    /$$$                              
| $$$$  /$$$$  /$$$$$$   /$$$$$$   /$$$$$$ 
| $$ $$/$$ $$ /$$__  $$ /$$__  $$ /$$__  $$
| $$  $$$| $$| $$  \ $$| $$  \__/| $$$$$$$$
| $$\  $ | $$| $$  | $$| $$      | $$_____/
| $$ \/  | $$|  $$$$$$/| $$      |  $$$$$$$
|__/     |__/ \______/ |__/       \_______/
` + "==========================================================".slice(Math.floor(Math.random() * 25))) + odiv.innerHTML
  }, 50);
}

const funk = () => {
  setInterval(() => {
    div.style.textShadow = `${Math.floor(Math.random() * 500)-10}px ${Math.floor(Math.random() * 500)-10}px 0 rgba(255, 255, 255, .3${Math.floor(Math.random() * 10)})`
    console.log(
    `*FUNK*`
    + `${ Math.floor(Math.random() * 500) - 1000 }px ${ Math.floor(Math.random() * 500) - 1000 }px 0 rgba(255, 255, 255, .3${ Math.floor(Math.random() * 10) }`
    + "==========================================")
    // funk()
  }, Math.random() * 50);
}

const clear = () => {
  setInterval(() => {
    div.innerHTML = ""
    console.log(`
  /$$$$$$  /$$                              
 /$$__  $$| $$                              
| $$  \__/| $$  /$$$$$$   /$$$$$$   /$$$$$$ 
| $$      | $$ /$$__  $$ |____  $$ /$$__  $$
| $$      | $$| $$$$$$$$  /$$$$$$$| $$  \__/
| $$    $$| $$| $$_____/ /$$__  $$| $$      
|  $$$$$$/| $$|  $$$$$$$|  $$$$$$$| $$      
 \______/ |__/ \_______/ \_______/|__/      
` + "==========================================================".slice(Math.floor(Math.random() * 25)))
  // odiv.innerHTML = JSON.stringify(localStorage)
  odiv.innerHTML = `/$$      /$$                              \n| $$$    /$$$                              | $$$$  /$$$$  /$$$$$$   /$$$$$$   /$$$$$$ | $$ $$/$$ $$ /$$__  $$ /$$__  $$ /$$__  $$| $$  $$$| $$| $$  \ $$| $$  \__/| $$$$$$$$| $$\  $ | $$| $$  | $$| $$      | $$_____/| $$ \/  | $$|  $$$$$$/| $$      |  $$$$$$$|__/     |__/ \______/ |__/       \_______/==============================================================`
  for (let n = 0; n < 100; n++) {odiv.innerHTML += `/$$      /$$                              \n| $$$    /$$$                              | $$$$  /$$$$  /$$$$$$   /$$$$$$   /$$$$$$ | $$ $$/$$ $$ /$$__  $$ /$$__  $$ /$$__  $$| $$  $$$| $$| $$  \ $$| $$  \__/| $$$$$$$$| $$\  $ | $$| $$  | $$| $$      | $$_____/| $$ \/  | $$|  $$$$$$/| $$      |  $$$$$$$|__/     |__/ \______/ |__/       \_______/==============================================================`}
  }, 30000);
}

add()
clear()
// funk()